In [2]:
import pandas as pd

In [5]:
clientes = pd.DataFrame({
    'ClienteID': [1,2,3],
    'Nombre': ['Ana', 'Luis', 'Marta']
})
clientes

   ClienteID Nombre
0          1    Ana
1          2   Luis
2          3  Marta

In [6]:
pedidos= pd.DataFrame({
    'PedidoID': [101,102,103],
    'ClienteID': [1,2,3],
    'Producto': ['Laptop', 'Mouse', 'Teclado']
})
pedidos

   PedidoID  ClienteID Producto
0       101          1   Laptop
1       102          2    Mouse
2       103          3  Teclado

In [8]:
combinando = pd.merge(clientes, pedidos, on='ClienteID', how='inner')
combinando

   ClienteID Nombre  PedidoID Producto
0          1    Ana       101   Laptop
1          2   Luis       102    Mouse
2          3  Marta       103  Teclado